guitarhua/ezos/components/cpn_uip/chips/stm32_eth_uip.h
/**
  ******************************************************************************
  * @file    stm32_eth.h
  * @author  MCD Application Team
  * @version V1.0.0
  * @date    06/19/2009
  * @brief   This file contains all the functions prototypes for the Ethernet
  *          firmware library.
  ******************************************************************************
  * @copy
  *
  * THE PRESENT FIRMWARE WHICH IS FOR GUIDANCE ONLY AIMS AT PROVIDING CUSTOMERS
  * WITH CODING INFORMATION REGARDING THEIR PRODUCTS IN ORDER FOR THEM TO SAVE
  * TIME. AS A RESULT, STMICROELECTRONICS SHALL NOT BE HELD LIABLE FOR ANY
  * DIRECT, INDIRECT OR CONSEQUENTIAL DAMAGES WITH RESPECT TO ANY CLAIMS ARISING
  * FROM THE CONTENT OF SUCH FIRMWARE AND/OR THE USE MADE BY CUSTOMERS OF THE
  * CODING INFORMATION CONTAINED HEREIN IN CONNECTION WITH THEIR PRODUCTS.
  *
  * <h2><center>&copy; COPYRIGHT 2009 STMicroelectronics</center></h2>
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __STM32_ETH_UIP_H
#define __STM32_ETH_UIP_H

/* Includes ------------------------------------------------------------------*/
#include "tapdev.h"
#include "stm32f10x.h"



/**
  ******************************************************************************
  * -V1.0.0, 2013.1.11, mousie
  *          - 属于STM32F105/STM32F107 网络底层硬件驱动配置.
  *          - 支持 MII / RMII 数据接口, 二选一.
  *          - 可选择是否使用 MCO 口. 即通过STM32芯片引脚给提供CLK信号.
  *          - 此驱动用于支持 uIP 组件. 请勿直接调用.
  *          - 硬件上, 需要通过 MII 或 RMII 接口, 外接物理层芯片 DP83848.
  ******************************************************************************
  */

/**
  ******************************************************************************
  * @defgroup STM32_ETH_Configure
  * @brief    用户配置
  ******************************************************************************
  * @{
  */
#include "stm32f10x_conf.h"                                                     // 硬件集中配置文件

/**
  ******************************************************************************
  * 网络接口配置
  *          +----------------------------------------------------------+
  *          |              STM32f105/107 网络引脚对应关系              |
  *          +------------------+-------------------+-------------------+
  *          | MII Mode         |   RMII Mode       | STM32 Pin (Remap) |
  *          +------------------+-------------------+-------------------+
  *          | ETH_MII_TX_CLK   |                   |   PC3             |
  *          | ETH_MII_TX_EN    | ETH_RMII_TX_EN    |   PB11            |
  *          | ETH_MII_TXD0     | ETH_RMII_TXD0     |   PB12            |
  *          | ETH_MII_TXD1     | ETH_RMII_TXD1     |   PB13            |
  *          | ETH_MII_TXD2     |                   |   PC2             |
  *          | ETH_MII_TXD3     |                   |   PB8             |
  *          |                  |                   |                   |
  *          | ETH_MII_RX_CLK   | ETH_RMII_REF_CLK  |   PA1             |
  *          | ETH_MII_RX_DV    | ETH_RMII_CRS_DV   |   PA7     (PD8)   |
  *          | ETH_MII_RX_ER    |                   |   PB10            |
  *          | ETH_MII_RXD0     | ETH_RMII_RXD0     |   PC4     (PD9)   |
  *          | ETH_MII_RXD1     | ETH_RMII_RXD1     |   PC5     (PD10)  |
  *          | ETH_MII_RXD2     |                   |   PB0     (PD11)  |
  *          | ETH_MII_RXD3     |                   |   PB1     (PD12)  |
  *          |                  |                   |                   |
  *          | ETH_MII_MDIO     | ETH_RMII_MDIO     |   PA2             |
  *          | ETH_MII_MDC      | ETH_RMII_MDC      |   PC1             |
  *          | ETH_MII_CRS_WKUP |                   |   PA0             |
  *          | ETH_MII_COL      |                   |   PA3             |
  *          |                  |                   |                   |
  *          | MCO              | MCO               |   PA8   (*可选配) |
  *          | ETH_MII_PPS_OUT  | ETH_RMII_PPS_OUT  |   PB5   (*可选配) |
  *          +------------------+-------------------+-------------------+
  ******************************************************************************
  */
//#define STM32_ETH_UIP_ENABLE                                                    ///< 使用 stm32f105/107 作为UIP的网络驱动芯片
//
//#define ETH_MII_MODE                                                            ///< MII通讯模式
//#define ETH_RMII_MODE                                                           ///< RMII通讯模式
//#define ETH_IRQ_PRIORITY                0x0                                     ///< 设置中断优先级. 高2位为可抢占主优先级, 低2位为非抢占的子优先级
//
///// 使能STM32 ETH引脚重映射(Remap)功能
//#define ETH_PIN_REMAP_ENABLE
///// 使能MCO口, 输出25M/50Mhz频率源. 若DP83848使用外部晶振, 无需使能
//#define ETH_MCO_ENABLE
///// 使能时钟同步协议输出(IEEE1588 PTP). 若不使能, ETH_MII_PPS_OUT / ETH_RMII_PPS_OUT 可作为普通引脚使用
//#define ETH_PTP_ENABLE

#if ((defined ETH_MII_MODE) && (defined ETH_RMII_MODE))
    #error "ETH_MODE define error!"
#endif
/**
  * @}
  */



#ifdef STM32_ETH_UIP_ENABLE
/** @addtogroup STM32_ETH_Driver
  * @{
  */

/** @defgroup ETH_Exported_Types
  * @{
  */

/**
  * @brief  ETH MAC Init structure definition
  */
typedef struct {
/**
  * @brief / * MAC
  */
  uint32_t             ETH_AutoNegotiation;           /*!< Selects or not the AutoNegotiation with the external PHY */
  uint32_t             ETH_Watchdog;                  /*!< Enable/disable Watchdog timer */
  uint32_t             ETH_Jabber;                    /*!< Enable/disable Jabber timer */
  uint32_t             ETH_InterFrameGap;             /*!< Selects minimum IFG between frames during transmission */
  uint32_t             ETH_CarrierSense;              /*!< Enable/disable Carrier Sense */
  uint32_t             ETH_Speed;                     /*!< Indicates the Ethernet speed: 10/100 Mbps */
  uint32_t             ETH_ReceiveOwn;                /*!< Enable/disable the reception of frames when the TX_EN signal is asserted in Half-Duplex mode */
  uint32_t             ETH_LoopbackMode;              /*!< Enable/disable internal MAC MII Loopback mode */
  uint32_t             ETH_Mode;                      /*!< Selects the MAC duplex mode: Half-Duplex or Full-Duplex mode */
  uint32_t             ETH_ChecksumOffload;           /*!< Enable/disable the calculation of complement sum of all received Ethernet frame payloads */
  uint32_t             ETH_RetryTransmission;         /*!< Enable/disable the MAC attempt retries transmission, based on the settings of BL, when a colision occurs (Half-Duplex mode) */
  uint32_t             ETH_AutomaticPadCRCStrip;      /*!< Enable/disable Automatic MAC Pad/CRC Stripping */
  uint32_t             ETH_BackOffLimit;              /*!< Selects the BackOff limit value */
  uint32_t             ETH_DeferralCheck;             /*!< Enable/disable deferral check function (Half-Duplex mode) */
  uint32_t             ETH_ReceiveAll;                /*!< Enable/disable all frames reception by the MAC (No fitering)*/
  uint32_t             ETH_SourceAddrFilter;          /*!< Selects EnableNormal/EnableInverse/disable Source Address Filter comparison */
  uint32_t             ETH_PassControlFrames;         /*!< Selects None/All/FilterPass of all control frames (including unicast and multicast PAUSE frames) */
  uint32_t             ETH_BroadcastFramesReception;  /*!< Enable/disable reception of Broadcast Frames */
  uint32_t             ETH_DestinationAddrFilter;     /*!< Selects EnableNormal/EnableInverse destination filter for both unicast and multicast frames */
  uint32_t             ETH_PromiscuousMode;           /*!< Enable/disable Promiscuous Mode */
  uint32_t             ETH_MulticastFramesFilter;     /*!< Selects the Multicast Frames filter: None/HashTableFilter/PerfectFilter/PerfectHashTableFilter */
  uint32_t             ETH_UnicastFramesFilter;       /*!< Selects the Unicast Frames filter: HashTableFilter/PerfectFilter/PerfectHashTableFilter  */
  uint32_t             ETH_HashTableHigh;             /*!< This field contains the higher 32 bits of Hash table.  */
  uint32_t             ETH_HashTableLow;              /*!< This field contains the lower 32 bits of Hash table.  */
  uint32_t             ETH_PauseTime;                 /*!< This field holds the value to be used in the Pause Time field in the transmit control frame */
  uint32_t             ETH_ZeroQuantaPause;           /*!< Enable/disable the automatic generation of Zero-Quanta Pause Control frames */
  uint32_t             ETH_PauseLowThreshold;         /*!< This field configures the threshold of the PAUSE to be checked for automatic retransmission of PAUSE Frame */
  uint32_t             ETH_UnicastPauseFrameDetect;   /*!< Enable/disable MAC to detect the Pause frames (with MAC Address0 unicast address and unique multicast address) */
  uint32_t             ETH_ReceiveFlowControl;        /*!< Enable/disable the MAC to decode the received Pause frame and disable its transmitter for a specified (Pause Time) time */
  uint32_t             ETH_TransmitFlowControl;       /*!< Enable/disable the MAC to transmit Pause frames (Full-Duplex mode) or the MAC back-pressure operation (Half-Duplex mode) */
  uint32_t             ETH_VLANTagComparison;         /*!< Selects the 12-bit VLAN identifier or the complete 16-bit VLAN tag for comparison and filtering */
  uint32_t             ETH_VLANTagIdentifier;         /*!< VLAN tag identifier for receive frames */

/**
  * @brief / * DMA
  */
  uint32_t             ETH_DropTCPIPChecksumErrorFrame; /*!< Enable/disable Dropping of TCP/IP Checksum Error Frames */
  uint32_t             ETH_ReceiveStoreForward;         /*!< Enable/disable Receive store and forward */
  uint32_t             ETH_FlushReceivedFrame;          /*!< Enable/disable flushing of received frames */
  uint32_t             ETH_TransmitStoreForward;        /*!< Enable/disable Transmit store and forward */
  uint32_t             ETH_TransmitThresholdControl;    /*!< Selects the Transmit Threshold Control */
  uint32_t             ETH_ForwardErrorFrames;          /*!< Enable/disable forward to DMA of all frames except runt error frames */
  uint32_t             ETH_ForwardUndersizedGoodFrames; /*!< Enable/disable Rx FIFO to forward Undersized frames (frames with no Error and length less than 64 bytes) including pad-bytes and CRC) */
  uint32_t             ETH_ReceiveThresholdControl;     /*!< Selects the threshold level of the Receive FIFO */
  uint32_t             ETH_SecondFrameOperate;          /*!< Enable/disable the DMA process of a second frame of Transmit data even before status for first frame is obtained */
  uint32_t             ETH_AddressAlignedBeats;         /*!< Enable/disable Address Aligned Beats */
  uint32_t             ETH_FixedBurst;                  /*!< Enable/disable the AHB Master interface fixed burst transfers */
  uint32_t             ETH_RxDMABurstLength;            /*!< Indicate the maximum number of beats to be transferred in one Rx DMA transaction */
  uint32_t             ETH_TxDMABurstLength;            /*!< Indicate the maximum number of beats to be transferred in one Tx DMA transaction */
  uint32_t             ETH_DescriptorSkipLength;        /*!< Specifies the number of word to skip between two unchained descriptors (Ring mode) */
  uint32_t             ETH_DMAArbitration;              /*!< Selects DMA Tx/Rx arbitration */
}ETH_InitTypeDef;

/**--------------------------------------------------------------------------**/
/**
  * @brief                           DMA descriptors types
  */
/**--------------------------------------------------------------------------**/

/**
  * @brief  ETH DMA Desciptors data structure definition
  */
typedef struct  {
  uint32_t   Status;                /*!< Status */
  uint32_t   ControlBufferSize;     /*!< Control and Buffer1, Buffer2 lengths */
  uint32_t   Buffer1Addr;           /*!< Buffer1 address pointer */
  uint32_t   Buffer2NextDescAddr;   /*!< Buffer2 or next descriptor address pointer */
} ETH_DMADESCTypeDef;

/**
  * @}
  */

/** @defgroup ETH_Exported_Constants
  * @{
  */
/**--------------------------------------------------------------------------**/
/**
  * @brief                          ETH Frames defines
  */
/**--------------------------------------------------------------------------**/

